DHL/Paketversand/Test 1/request.txt

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Header><NS1:Authentification xmlns:NS1="http://dhl.de/webservice/cisbase"><user xmlns="http://dhl.de/webservice/cisbase">2222222222_01</user><signature xmlns="http://dhl.de/webservice/cisbase">pass</signature></NS1:Authentification></SOAP-ENV:Header><SOAP-ENV:Body xmlns:NS2="http://dhl.de/webservice/cisbase"><CreateShipmentOrderRequest xmlns="http://dhl.de/webservices/businesscustomershipping"><Version><majorRelease xmlns=""></majorRelease><minorRelease xmlns=""></minorRelease></Version><ShipmentOrder xmlns=""><sequenceNumber>123456</sequenceNumber><Shipment><ShipmentDetails><product>V01PAK</product><accountNumber xmlns="http://dhl.de/webservice/cisbase">22222222220101</accountNumber><customerReference>Kundennummer 123456</customerReference><shipmentDate>2018-12-31</shipmentDate><ShipmentItem><weightInKG>5</weightInKG><lengthInCM>0</lengthInCM><widthInCM>0</widthInCM><heightInCM>0</heightInCM></ShipmentItem><Notification><recipientEmailAddress>Absender@muster.de</recipientEmailAddress></Notification></ShipmentDetails><Shipper><Name><name1 xmlns="http://dhl.de/webservice/cisbase">Absender Zeile 1</name1><name2 xmlns="http://dhl.de/webservice/cisbase">Absender Zeile 2</name2><name3 xmlns="http://dhl.de/webservice/cisbase">Absender Zeile 3</name3></Name><Address><streetName xmlns="http://dhl.de/webservice/cisbase">Vegesacker Heerstr.</streetName><streetNumber xmlns="http://dhl.de/webservice/cisbase">111</streetNumber><addressAddition xmlns="http://dhl.de/webservice/cisbase">2.Etage</addressAddition><dispatchingInformation xmlns="http://dhl.de/webservice/cisbase">Abgangsinformation</dispatchingInformation><zip xmlns="http://dhl.de/webservice/cisbase">28757</zip><city xmlns="http://dhl.de/webservice/cisbase">Bremen</city><Origin xmlns="http://dhl.de/webservice/cisbase"><country>Germany</country><countryISOCode>DE</countryISOCode></Origin></Address><Communication><phone xmlns="http://dhl.de/webservice/cisbase">+49421123456</phone><email xmlns="http://dhl.de/webservice/cisbase">Empfaengerin@muster.de</email><contactPerson xmlns="http://dhl.de/webservice/cisbase">Frau Empfänger</contactPerson></Communication></Shipper><Receiver><name1 xmlns="http://dhl.de/webservice/cisbase">Empfänger Zeile 1</name1><Address><name2 xmlns="http://dhl.de/webservice/cisbase">Empfänger Zeile 2</name2><name3 xmlns="http://dhl.de/webservice/cisbase">Empfänger Zeile 3</name3><streetName xmlns="http://dhl.de/webservice/cisbase">Neu-Galliner-Ring</streetName><streetNumber xmlns="http://dhl.de/webservice/cisbase">8</streetNumber><addressAddition xmlns="http://dhl.de/webservice/cisbase">3. Etage</addressAddition><dispatchingInformation xmlns="http://dhl.de/webservice/cisbase">?</dispatchingInformation><zip xmlns="http://dhl.de/webservice/cisbase">19258</zip><city xmlns="http://dhl.de/webservice/cisbase">Gallin</city><Origin xmlns="http://dhl.de/webservice/cisbase"><country>Germany</country><countryISOCode>DE</countryISOCode><state>?</state></Origin></Address><Communication><phone xmlns="http://dhl.de/webservice/cisbase">+49421123456789</phone><email xmlns="http://dhl.de/webservice/cisbase">empfaengerin@muster.de</email><contactPerson xmlns="http://dhl.de/webservice/cisbase">Frau Empfängerin</contactPerson></Communication></Receiver></Shipment><PrintOnlyIfCodeable active="1"/><labelResponseType>URL</labelResponseType></ShipmentOrder></CreateShipmentOrderRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>
